# GetNumResourceTags

## Description
Returns the number of tags attached to the specified resource.

```pascal
FUNCTION GetNumResourceTags(handle : HANDLE) : INTEGER;
```

```python

def vs.GetNumResourceTags(handle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|The handle to the resource|

## Returns
The number of tags attached to the specified resource.

## See Also
VS Functions:
SetResourceTags| GetResourceTags

## Version
Availability: from Vectorworks 2017
## Category
* General Edit